In [1]:
import pandas as pd
import numpy as np

In [5]:
colors = pd.read_csv('./dataset/colors.csv')
colors.head(5)

   id            name     rgb is_trans
0  -1         Unknown  0033B2        f
1   0           Black  05131D        f
2   1            Blue  0055BF        f
3   2           Green  237841        f
4   3  Dark Turquoise  008F9B        f

In [18]:
inventory_parts = pd.read_csv('./dataset/inventory_parts.csv')
inventory_parts.head(5)

   inventory_id     part_num  color_id  quantity is_spare
0             1     48379c01        72         1        f
1             1        48395         7         1        f
2             1     mcsport6        25         1        f
3             1       paddle         0         1        f
4             3  11816pr0005        78         1        f

In [20]:
inventory_parts['quantity'].value_counts(ascending=True)

quantity
166         1
260         1
388         1
450         1
810         1
        ...
6       20144
3       31219
4       62072
2      161796
1      239479
Name: count, Length: 239, dtype: int64

In [50]:
inventory_parts_with_color = inventory_parts.merge(colors, left_on='color_id', right_on='id', how='left')
inventory_parts_with_color.rename(columns={'name': 'color_name'}, inplace=True)
inventory_parts_with_color = inventory_parts_with_color[['inventory_id', 'part_num', 'color_id', 'color_name', 'rgb', 'is_trans', 'quantity', 'is_spare']]
inventory_parts_with_color.head(5)

,inventory_id,part_num,color_id,color_name,rgb,is_trans,quantity,is_spare
0,1,48379c01,72,Dark Bluish Gray,6C6E68,f,1,f
1,1,48395,7,Light Gray,9BA19D,f,1,f
2,1,mcsport6,25,Orange,FE8A18,f,1,f
3,1,paddle,0,Black,05131D,f,1,f
4,3,11816pr0005,78,Light Flesh,F6D7B3,f,1,f

In [17]:
inventories = pd.read_csv('./dataset/inventories.csv')
inventories.head(5)

   id  version set_num
0   1        1  7922-1
1   3        1  3931-1
2   4        1  6942-1
3  15        1  5158-1
4  16        1   903-1

In [21]:
inventory_sets = pd.read_csv('./dataset/inventory_sets.csv')
inventory_sets.head(5)

   inventory_id  set_num  quantity
0            35  75911-1         1
1            35  75912-1         1
2            39  75048-1         1
3            39  75053-1         1
4            50   4515-1         1

In [23]:
sets = pd.read_csv('./dataset/sets.csv')
sets.head(5)

  set_num                        name  year  theme_id  num_parts
0    00-1             Weetabix Castle  1970       414        471
1  0011-2           Town Mini-Figures  1978        84         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          2
3  0012-1          Space Mini-Figures  1979       143         12
4  0013-1          Space Mini-Figures  1979       143         12

In [25]:
parts = pd.read_csv('./dataset/parts.csv')
parts.head(5)

  part_num                                               name  part_cat_id
0   0687b1                        Set 0687 Activity Booklet 1           17
1     0901  Baseplate 16 x 30 with Set 080 Yellow House Print            1
2     0902  Baseplate 16 x 24 with Set 080 Small White Hou...            1
3     0903     Baseplate 16 x 24 with Set 080 Red House Print            1
4     0904  Baseplate 16 x 24 with Set 080 Large White Hou...            1

In [33]:
part_categories = pd.read_csv('./dataset/part_categories.csv')
part_categories.head(5)

   id                     name
0   1               Baseplates
1   2           Bricks Printed
2   3            Bricks Sloped
3   4  Duplo, Quatro and Primo
4   5           Bricks Special

In [39]:
parts_with_categories = parts.merge(part_categories, left_on='part_cat_id', right_on='id', how='left')
parts_with_categories.rename(columns={'name_y': 'category', 'name_x': 'name'}, inplace=True)
parts_with_categories = parts_with_categories[['part_num', 'name', 'part_cat_id', 'category']]
parts_with_categories.head(5)

,part_num,name,part_cat_id,category
0,0687b1,Set 0687 Activity Booklet 1,17,Non-LEGO
1,0901,Baseplate 16 x 30 with Set 080 Yellow House Print,1,Baseplates
2,0902,Baseplate 16 x 24 with Set 080 Small White Hou...,1,Baseplates
3,0903,Baseplate 16 x 24 with Set 080 Red House Print,1,Baseplates
4,0904,Baseplate 16 x 24 with Set 080 Large White Hou...,1,Baseplates

In [51]:
inventory_with_parts = inventory_parts_with_color.merge(parts_with_categories, on='part_num', how='left')
inventory_with_parts.rename(columns={'name': 'part_name'}, inplace=True)
inventory_with_parts.head(5)

,inventory_id,part_num,color_id,color_name,rgb,is_trans,quantity,is_spare,part_name,part_cat_id,category
0,1,48379c01,72,Dark Bluish Gray,6C6E68,f,1,f,Sports Promo Figure Base with Feet,27.0,Minifig Accessories
1,1,48395,7,Light Gray,9BA19D,f,1,f,Sports Promo Snowboard from McDonald's Sports ...,27.0,Minifig Accessories
2,1,mcsport6,25,Orange,FE8A18,f,1,f,Sports Promo Figure Head Torso Assembly McDona...,13.0,Minifigs
3,1,paddle,0,Black,05131D,f,1,f,Sports Promo Paddle from McDonald's Sports Sets,27.0,Minifig Accessories
4,3,11816pr0005,78,Light Flesh,F6D7B3,f,1,f,"Minifig Head Modified - Friends - Green Eyes, ...",13.0,Minifigs

In [28]:
themes = pd.read_csv('./dataset/themes.csv')
themes.head(5)

   id            name  parent_id
0   1         Technic        NaN
1   2  Arctic Technic        1.0
2   3     Competition        1.0
3   4  Expert Builder        1.0
4   5           Model        1.0

In [40]:
sets_with_themes = sets.merge(themes, left_on='theme_id', right_on='id', how='left')
sets_with_themes.rename(columns={'name_y': 'theme_name', 'name_x': 'name'}, inplace=True)
sets_with_themes = sets_with_themes[['set_num', 'name', 'year', 'theme_id', 'theme_name', 'parent_id', 'num_parts']]
sets_with_themes.head(5)

,set_num,name,year,theme_id,theme_name,parent_id,num_parts
0,00-1,Weetabix Castle,1970,414,Castle,411.0,471
1,0011-2,Town Mini-Figures,1978,84,Supplemental,67.0,12
2,0011-3,Castle 2 for 1 Bonus Offer,1987,199,Lion Knights,186.0,2
3,0012-1,Space Mini-Figures,1979,143,Supplemental,126.0,12
4,0013-1,Space Mini-Figures,1979,143,Supplemental,126.0,12